app/Controllers/Login.php

    public function autenticar()
    {
        $dados = $this->request->getVar();

        $usuario = $this->usuario->where('username', $dados['username'])
        ->where('senha', md5($dados['senha']))->first();
---
SELECT *
FROM `usuarios`
WHERE `username` = 'admin'
AND `senha` = '123'
 LIMIT 1